/*#ссылки*/

//http://online.swiftplayground.run/

////////////////////////////////////////////////////////////////

/*#операторы*/

//Константы
let x = 1;

//Переменные
var x = 1;

//Операторы диапазона
0 ..< 3
0 ... 3

//if

if x == 3 {
	x = 5
} else if x == 4 {}

//switch
switch x {
	case 10:print(10)
	case 20:print(20)
	default: print(x)
}

////////////////////////////////////////////////////////////////

/*#типы данных*/

let x: Int = 1;
let boolVal: Bool = true;


let str: String = "Hello";
//интерполяция строки
let str = "Это строка номер: \(n)" //вставляет в строку переменную n

let char: Character = "A";
let y: Float = 1.25; // 6 знаков после запятой
let z: Double = 1.25 // 15 знаков после запятой

////////////////////////////////////////////////////////////////

/*#функции*/

print(x) // вывести в консоль

func write(a: Int, b: Int) -> Int{	//указать тип возвращаемого значения
	print('привет');
	return a + b
}

write(3, b: 5);